import { Injectable } from "@angular/core";
import { Tour } from "./model/tour";

@Injectable()

export class DataService {
    constructor() { }
    tourClasses: string[] = [
        "Royal Class",
        "First Class",
        "Premium Class",
        "Cost Class",
        "Budget Class",
    ]
    countries: any[] = [
        {
            country: 'آلمان',
            title: ' مدارک لازم جهت اخذ ویزای آلمان ',
            image: '/assets/images/country/1.jpg',
            description: [
                ' معرفی نامه خطاب به سفارت آلمان به زبان فارسی از یک سازمان دولتی و یا وابسته به دولت و یا انجمن صنفی حاوی اطلاعاتی از قبیل نام و نام خانوادگی متقاضی، پست سازمانی وی در شرکت، دلیل و زمان سفر (به همراه دو نسخه کپی از آن).',
                '  اصل گذرنامه معتبر با حداقل 7 ماه اعتبار از تاریخ برگشت تور (امضا شده) به همراه کپی. ',
                '      2 قطعه عکس 5/4*5/3 کاملاٌ جدید ، رنگی با زمینه سفید و بدون لبخند از روبرو (با عکس پاسپورت و ویزای شینگن قبلی یکسان نباشد).   ',
                'اصل و فتوکپی شناسنامه و گذرنامه متقاضی و همسرو فرزندان متقاضی. ',
                '  اصل و کپی سابقه بیمه شخص، ممهور به مهر سازمان تامین اجتماعی و لیست واریز حق بیمه به سازمان تامین اجتماعی مربوط به شش ماه آخر .  ',
                '    مدارک اشتغال به کار به نام مسافر اعم از:       اعضای هیات مدیره شرکتها : اصل و کپی روزنامه رسمی به همراه آگهی آخرین تغییرات وتاسیسات به انضمام نامه به زبان فارسی معرفی روی سربرگ با مهر و امضای شرکت ',
                '      کارمندان بخش خصوصی: مدارک بالا به انضمام معرفی نامه فارسی از شرکت، صاحبان حرف  و مشاغل آزاد : اصل و کپی جواز کسب یا اصل و کپی پروانه بهره برداری یا اصل و کپی کارت بازرگانی به همراه رسید آخرین پرداخت مالیاتی',
                '    کادر پزشکی :  اصل و کپی کارت نظام پزشکی و پروانه مطب     ',
                ' مهندسین  :اصل وکپی پروانه اشتغال و اصل و کپی کارت نظام مهندسی به همراه روزنامه رسمی یا سابقه بیمه ',
                '      اعضای هیات علمی دانشگاه :  اصل و کپی کارت پرسنلی و اصل و کپی حکم استخدامی و فیش حقوقی  ',
                '  کارمندان دوایر دولتی: اصل و کپی کارت پرسنلی و اصل و کپی حکم استخدام و کپی فیش حقوقی و معرفی نامه بیانگرارتباط کاری و سمت فرد متقاضی در شرکت یا سازمان مربوطه ',
                '     دانشجویان و دانش آموزان:گواهی اشتغال به تحصیل و کارت دانشجویی یا دانش آموزی    ',
                '  بازنشستگان دوایر دولتی :  اصل و کپی کارت یا حکم بازنشستگی ',
                '  {در صورت تاهل و شاغل بودن همسر مسافر، ارائه مدارک شغلی همسر الزامی است.}',
                ' پرینت حساب بانکی به نام مسافر مربوط به 3 ماه گذشته با مانده حساب30 میلیون تومان(حساب جاری و سپرده)        (با مهر و امضا بانک مربوطه)       ارائه سند مالکیت که به نام متقاضی و یا همسر متقاضی باشد. (به همراه کپی از تمام صفحات آن) ',
                ' مبلغ 60 یورو هزینه تحویل مدارک داخل سفارت آلمان (یورو حتما به صورت اسکناس باشد.)',
                '      حداقل زمان لازم برای رسیدگی به در خواست روادید 15 روز می باشد که در این 15 روز اصل پاسپورت شما نزد سفارت می ماند لطفا جهت برنامه ریزی این موضوع را مد نظر داشته باشید.',
                'لطفا تمام کپی ها را بر روی برگه  A4  تهیه فرمایید.'
            ],
            file: 'http://kariztours.com/scripts/filemanager/userfiles/_آلمان.pdf',
        },
        {
            country: 'فرانسه',
            title: 'مدارک سفارت فرانسه ',
            image: '/assets/images/country/3.jpg',
            description: [
                'لیست مدارک مورد نیاز الزامی',
                '1-یک عدد فرم درخواست ویزای کوتاه مدت که به زبان فرانسه یا انگلیسی و بطور خوانا تکمیل شده باشد.',
                '2-داشتن گذرنامه معتبر 3 ماه پس از تاریخ اقامت در منطقه شنگن وگذرنامه بایستی حد اقل 2 صفحه سفید جهت مهر کردن ویزا و مهرهای ورود و خروج در فضای شنگن را دارا باشد.  گذرنامه بایستی سالم باشد و متصدی بخش کنسولگری از پذیرفتن  گذرنامه های ناسالم اجتناب می ورزد',
                '3-کپی صفحات حاوی مشخصات متقاضی (صفحه 1 الی 5)',
                '4-کپی تمامی صفحات گذرنامه که دارای ویزا و یا مهر صدور تقاضای ویزا باشد',
                '5-دو قطعه عکس : عکسها بایستی جدید و ابعاد آنها ،cm  3.5 Xcm 4.5 بر روی زمینه سفید باشد.  70الی 80 % عکس بایستی از چهره باشد.',
                '6-اصل و کپی تمام صفحات شناسنامه',
                '7-مدارک اشتغال به کار',
                'افراد شاغل: گواهی اشتغال به کار از طرف کارفرما که بایستی تاریخ استخدام، حقوق ماهانه، علت و مجوز مرخصی در آن ذکر شده باشد. داشتن آخرین 3 فیش حقوق ماهانه + (یک کپی از هر مدرک الزامی است) ',
                'افراد با مشاغل خصوصی: کپی روزنامه رسمی که در آن اطلاعات مربوط به شرکت مشخص شده باشد + صورت حساب 3 ماهه حسابهای بانکی مربوط به شرکت.  ',
                'افراد غیر شاغل: گواهی اشتغال به کار همسر + رونوشت گذرنامه + شناسنامه همسر  محصلین: گواهی اشتغال به تحصیل در مدرسه و یا دانشگاه + کارت دانشجویی + (کپی)',
                '8-بستگی به نوع سفر ارائه مدارک زیر الزامی است:',
                'سفر توریستی:  ارائه رزرواسیون هتل سفر تجاری:دعوت نامه از طرف شرکت دعوت کننده در فرانسه و رزرواسیون هتل ',
                'سفر جهت دیدار اقوام و یا دوستان: اصل دعوت نامه تنظیم شده توسط شهرداری محل سکونت شخص دعوت کننده در فرانسه. اصل و کپی دعوت نامه در هنگام درخواست ویزا الزامی است.',
                '9-مدارک و منابع شرایط مالی',
                'سفر توریستی و یا دیدار از اقوام و یا دوستان: اصل صورت حساب بانکی 3 ماه اخیر  ',
                'سفر تجاری: در صورت داشتن نامه مبنی بر تعهد مالی و تقبل هزینه از جانب کارفرما و یا شرکت دعوت کننده و همراه داشتن اصل صورت حساب بانکی 3 ماه اخیر متقاضی',
                '10-رزرو بلیط  هواپیما رفت – برگشت',
                '11- مدرکی که دال بر پوشش پزشکی باشد:بیمه نامه پزشکی که کلیه هزینه پزشکی – بیمارستانی و یا بازگشت به کشور تا سقف 000/30 هزار یورو را در فضای شنگن تحت پوشش قرار دهد',
                '12-  هزینه بررسی پرونده:60 یورو می باشد و نقدا پرداخت می گردد.',
                'در پایان بررسی درخواست ویزا (پس از حدودا 15 روز)، که این تاریخ در زمان ارائه مدارک مشخص گردیده است، جهت باز پس گرفتن گذرنامه حضور شخص متقاضی الزامی می باشد.',
                '       ',
                'نکات مهم',
                'متقاضی درخواست روادید بایستی با در دست داشتن اصل و رونوشت کلیه مدارک به کنسولگری مراجعه نماید: کنسولگری به هیچ وجه از مدارک شما کپی نمی گیرد. اصل مدارک در پایان مصاحبه عودت داده خواهند شد و هیچ مدرکی پس از شروع بررسی پرونده بازگردانده نمی شود.',
                'جهت اجتناب از هرگونه مشکل، خواهشمند است مدارک خود را شخصا، دقیق و منظم آماده کنید. فرم درخواست ویزا بایستی بطور کامل به زبان فرانسه و یا انگلیسی تکمیل و با ذکر تاریخ امضا شود.',
                'حضور شخص متقاضی الزامی است. گذرنامه متقاضی در طول مدت بررسی در نزد سفارت باقی می ماند.        ',
                'گذرنامه حدودا 12 روز پس از ارائه مدارک و در تاریخ مشخص شده در زمان تحویل مدارک فقط به شخص متقاضی تحویل داده می شود.',
                'ویزا به هیچ عنوان تمدید و یا تجدید نمیگردد مگر آنکه مدارک جدید ارائه گردد. هر درخواست به منزله درخواست جدید می باشد.',
                'بخش کنسولی حق درخواست مدارک بیشتر برای خود را محفوظ می دارد.',
                'افرادی که جهت برنامه های هنری، دانشگاهی و یا صمعی-بصری قصد سفر به فرانسه را دارند، بایستی قبلا با بخش همکاریها و فعالیتهای فرهنگی سفارت فرانسه (SCAC) با شماره 64094000 تماس حاصل نمایند.',
                'خواهشمند است در نظر داشته باشید که داشتن ویزا به تنهایی تضمینی برای ورود به خاک فرانسه نمی باشد. داشتن اصل مدارک لازم جهت اخذ ویزا در طول سفر الزامی می باشد. احتمال درخواست مدارک فوق در بدو ورود به خاک فرانسه از جانب  مسئولین  کشورفرانسه  امکان پذیر می باشد.',
            ],
            file: 'http://kariztours.com/scripts/filemanager/userfiles/فرانسه.pdf'
        },
        {
            country: 'ایتالیا',
            title: 'مدارک لازم جهت اخذ ویزای ایتالیا  ',
            image: '/assets/images/country/2.jpg',
            description: [
                'اصل و کپی گذرنامه با حداقل 6 ماه اعتبار از زمان برگشت تور اصل و کپی ویزاهای شنگن  قبلی یا ویزای کانادا-آمریکا-استرالیا-انگلستان ',
                'اصل و کپی مدارک شغلی متقاضی به همراه ترجمه به زبان ایتالیایی یا انگلیسی لیست 6 ماهه واریز حق بیمه تامین اجتماعی ',
                'معرفی نامه بیانگر ارتباط کاری و سمت فرد متقاضی در شرکت یا سازمان مربوطه',
                'اعضای هیات مدیره شرکتها : اصل و کپی روزنامه رسمی(با تاریخ صدور کمتر از 3سال) به همراه آگهی آخرین تغییرات به انضمام نامه به زبان انگلیسی معرفی روی سربرگ با مهر و امضای شرکت',
                'تغییرات احتمالی مربوط به تاسیس شرکت یا یک گواهی از ثبت شرکتها مبنی بر فعال بودن شرکت حتی اگر تغییراتش به ثبت نرسیده باشد ارائه نمایید.',
                'کارمندان بخش خصوصی: مدارک بالا به انضمام معرفی نامه انگلیسی از شرکت، اصل و کپی سابقه بیمه شخص، ممهور به مهر سازمان تامین اجتماعی و لیست واریز حق بیمه به سازمان تامین اجتماعی مربوط به شش ماه آخر     ',
                'صاحبان حرف  و مشاغل آزاد : اصل و کپی جواز کسب یا اصل و کپی پروانه بهره برداری یا اصل و کپی کارت بازرگانی به همراه رسید آخرین پرداخت مالیاتی',
                'کارت پرسنلی متقاضی نزدیک سازمان دولتی یا نیمه دولتی',
                'کارت بازرگانی به همراه رسید آخرین پرداخت مالیاتی',
                'کادر پزشکی :  اصل و کپی کارت نظام پزشکی و پروانه مطب',
                'مهندسین  :اصل وکپی پروانه اشتغال و اصل و کپی کارت نظام مهندسی به همراه روزنامه رسمی یا سابقه بیمه',
                'اعضای هیات علمی دانشگاه :  اصل و کپی کارت پرسنلی و اصل و کپی حکم استخدامی و فیش حقوقی',
                'کارمندان دوایر دولتی: اصل و کپی کارت پرسنلی و اصل و کپی حکم استخدام و کپی فیش حقوقی و معرفی نامه بیانگرارتباط کاری و سمت فرد متقاضی در شرکت یا سازمان مربوطه',
                ' دانشجویان و دانش آموزان:گواهی اشتغال به تحصیل و کارت دانشجویی یا دانش آموزی',
                'بازنشستگان دوایر دولتی :  اصل و کپی کارت یا حکم بازنشستگی',
                'مدارک بانکی: پرینت 3 ماه آخر حساب بانکی با مهر و امضای بانک با مانده حداقل حساب 30میلیون تومان به زبان انگلیسی ویا کارت اعتباری شخصی بین المللی مانند(American Express,Mastercard,Viza) (سپرده بانکی به صورت ثابت)',
                'اصل و کپی سند ملکی ( در صورت دارا بودن)به همراه ترجمه به زبان ایتالیایی یا انگلیسی',
                '2قطعه عکس 4*3 رنگی با زمینه سفید بدون لبخند و از روبرو جدید مغایر با عکس پاسپورت و ویزاهای قبلی ',
                'اصل و کپی تمام صفحات شناسنامه متقاضی به همراه ترجمه به زبان انگلیسی یا ایتالیایی و اصل و کپی شناسنامه همسر متقاضی  ',
                'مبلغ 60یورو هزینه تحویل مدارک داخل سفارت(یورو به صورت اسکناس باشد)',
                'توجه : در صورت سفر فرزند زیر 18 سال با یکی از اولیا،موافقت محضری پدر یا مادری که در ایران می ماند جهت خروج فرزند از کشور و سفر به ایتالیا ضروری می باشد در این موافقت نامه تاریخ سفر و اسم کشور ایتالیا باید ذکر شود.(ضمنا امضای فرم درخواست کودکان زیر 18 سال توسط پدر و مادر الزامیست).',
                'حداقل زمان لازم برای رسیدگی به درخواست روادید 15 روز میباشد که در این 15 روز اصل پاسپورت شما نزد سفارت میماند لطفا جهت برنامه ریزی این موضوع را مد نظر داشته باشید.',

            ],
            file: 'http://kariztours.com/scripts/filemanager/userfiles/ایتالیا.pdf'
        },
        {
            country: 'هلند',
            title: 'مدارک  لازم جهت اخذ ویزای توریستی هلند ',
            image: '/assets/images/country/5.jpg',
            description: [
                ' معرفی نامه خطاب به سفارت هلند به زبان انگلیسی از یک سازمان دولتی و یا وابسته به دولت و یا انجمن صنفی یا شرکت خصوصی که در آن مشغول به کار می باشید ،حاوی اطلاعاتی از قبیل نام و نام خانوادگی متقاضی، پست سازمانی وی در شرکت، دلیل و زمان سفر (به همراه یک نسخه کپی از آن).',
                ' اصل گذرنامه معتبر با حداقل 7 ماه اعتبار از تاریخ برگشت تور امضا شده( به همراه کپی از صفحات اول و دوم و سوم و چهارم)و کپی از ویزاهای شنگن قبلی،ویزای کانادا،آمریکا،استرالیا و انگلستان در صورت دارا بودن و اصل پاسپورت قبلی',
                ' 2 قطعه عکس 5/4*5/3 کاملاٌ جدید ، رنگی با زمینه سفید و بدون لبخند از روبرو متفاوت باپاسپورت و ویزاهای شینگن قبلی         اصل شناسنامه و ترجمه تمام صفحات شناسنامه        مدارک اشتغال به کار به نام مسافر اعم از: اصل سابقه بیمه شخص، ممهور به مهر سازمان تامین اجتماعی و لیست واریز حق بیمه به سازمان تامین اجتماعی مربوط به شش ماه آخر به انضمام اصل فیش پرداختی سبز یا آبی رنگ به سازمان تامین اجتماعی مربوط به 6ماه آخرباترجمه  ',
                'اعضای هیات مدیره شرکتها : اصل روزنامه رسمی تاسیس به همراه آگهی آخرین تغییرات  (و کپی از آنها )ولیست بیمه خود و پرسنل با ترجمه به زبان انگلیسی ',
                ' کارمندان بخش خصوصی: اصل روزنامه رسمی شرکت به همراه  آگهی تاسیس و آخرین تغییرات.(به همراه کپی از آنها ) و لیست بیمه 6ماه آخر به همراه فیش های پرداختی بیمه با ترجمه به زبان انگلیسی ',
                'صاحبان حرف  و مشاغل آزاد : اصل جواز کسب یا اصل پروانه بهره برداری یا اصل کارت بازرگانی به همراه رسید آخرین پرداخت مالیاتی.(به همراه کپی از آنها ) و لیست بیمه خود و پرسنل با ترجمه به زبان انگلیسی',
                '  کادر پزشکی :  اصل کارت نظام پزشکی و پروانه مطب (به همراه کپی ) و لیست بیمه پرسنل با ترجمه به زبان انگلیسی ',
                ' مهندسین  :اصل پروانه اشتغال و اصل کارت نظام مهندسی به همراه روزنامه رسمی و لیست بیمه خود و پرسنل با ترجمه ',
                ' اعضای هیات علمی دانشگاه :  اصل کارت پرسنلی و اصل حکم استخدامی و فیش حقوقی . (با ترجمه به زبان انگلیسی)',
                'کارمندان دوایر دولتی: اصل کارت پرسنلی و اصل حکم استخدام و فیش حقوقی ولیست بیمه (با ترجمه به زبان انگلیسی) ',
                'دانشجویان و دانش آموزان:گواهی اشتغال به تحصیل و کارت دانشجویی یا دانش آموزی با ترجمه به زبان انگلیسی',
                ' بازنشستگان دوایر دولتی :  اصل کارت یا حکم بازنشستگی وفیش حقوقی (با ترجمه به زبان انگلیسی) ',
                ' پرینت حساب بانکی به زبان انگلیسی به نام مسافر مربوط به 3 ماه گذشته با مانده حساب بالای 40 میلیون تومان با مهر و امضا بانک مربوطه(پرینت را حداکثریک هفته قبل از رفتن به سفارت تهیه نمایید) ',
                ' ارائه سند مالکیت که به نام متقاضی و یا همسر متقاضی باشد.( با ترجمه به زبان انگلیسی) ',
                'درصورت سفر فرزند زیر18 سال با یکی ازاولیا،موافقت محضری پدر یا مادری که در ایران می ماند جهت خروج فرزند ازکشور و سفر به هلند ضروری می باشد در این رضایت نامه تاریخ سفر و اسم کشور باید ذکر شود و سپس ترجمه شود، امضای فرم درخواست فرزندان زیر18 سال توسط پدر و مادر الزامی است.',
                'مبلغ 60 یورو هزینه تحویل مدارک داخل سفارت هلند (یورو حتما به صورت اسکناس باشد.) ',
                'حداقل زمان لازم برای رسیدگی به درخواست روادید 14 روز می باشد که در این 14 روز اصل پاسپورت شما نزد سفارت می ماند و نمی توانید سفرخارجی دیگری داشته باشد، لطفا جهت برنامه ریزی این موضوع را مد نظر داشته باشید.',
                'لطفا تمامی مدارک به زبان انگلیسی ترجمه شود و نیازی به مهر وزارت امورخارجه و تاییدیه دادگستری نمی باشد.',

            ],
            file: 'http://kariztours.com/scripts/filemanager/userfiles/_هلند.pdf'
        },
        {
            country: 'اسپانیا',
            title: 'مدارک سفارت اسپانیا',
            image: '/assets/images/country/4.jpg',
            description: [
                '* کلیه مدارک علاوه بر ترجمه اسپانیایی نیاز به تائیدیه دادگستری دارند.',
                '1) اصل  گذرنامه با امضاء، به همراه گذرنامه­ های قبلی  به همراه کپی از تمام صفحات گذرنامه  حتی صفحات سفید.',
                'الف) مدت اعتبار حداقل 1  سال از تاریخ ورود.',
                '2) 6 قطعه عکس 3.5 x 4.5 رنگی،  تمام رخ با زمینه سفید، کامل از روبرو، بدون لبخند، بدون عینک ، حداکثر برای 6 ماه اخیر',
                '3) اصل شناسنامه و ترجمه  به همراه کپی از کلیه صفحات آن.',
                '4) اصل و ترجمه  گواهی حساب بانکی با مهر و امضاء بانک. ( ارائه گردش حساب و گواهی تمکن الزامیست.)',
                'الف) حسابهای جاری: کارکرد سه ماه اخیر.',
                '* در صورت تعداد زیاد تراکنش، ارائه گردش حساب 1 ماه گذشته کافی می­باشد.',
                '* در صورت نداشتن گردش حساب، گواهی موجودی حساب نیز قابل ارائه می­باشد.',
                'ب) سپرده ­های بانکی.',
                ' * ارائه گردش حساب به زبان انگلیسی از طرف بانک، قابل قبول می­باشد.',
                '* باید حداقل موجودی حساب یا سپرده برای هر نفر 500.000.000ریال باشد.',
                '5) اصل و ترجمه  سند مالکیت.',
                '6) اصل  و ترجمه مدارک شغلی:',
                ' الف) پزشکان: پروانه مطب، پروانه دائم پزشکی، کارت نظام پزشکی و دانش­نامه تحصیلی.',
                'ب) وکلا: پروانه وکالت.',
                ' ج) مشاغل دولتی: حکم کارگزینی، آخرین فیش حقوقی و یا نامه از سازمان مربوطه با ذکر مدت اشتغال، میزان حقوق دریافتی وتاییدیه مرخصی، آخرین لیست بیمه.',
                ' د) بازنشسته ­ها: ارائه حکم بازنشستگی، ارائه آخرین فیش حقوقی.',
                'ه) مشاغل غیردولتی: گواهی اشتغال به کار از شرکت مربوطه و ارائه اصل آخرین روزنامه رسمی آن شرکت.',
                ' و) در صورت خویش فرما بودن: جواز کسب / آگهی تأسیس.',
                'ز) دانش آموزان، دانشجویان، معلمان، اساتید و اعضاء هیئت علمی دانشگاه ( اصل  و ترجمه نامه اشتغال به تحصیل یا اشتغال به کار ).',
                '* جهت دانش آموزانی که در سال تحصیلی قصد سفر دارند، علاوه بر نامه اشتغال به تحصیل، ارائه اصل و ترجمه رضایت­نامه کتبی از مدیریت مدرسه با ذکر تاریخ سفرالزامی می­باشد.',
                '7) برای فرزندان زیر 18 سال که بدون همراهی پدر، همچنین خانم های متأهل که تنها سفر می­کنند، رضایت­نامه محضری الزامی است.',
                '8) مدارک شغلی همسر برای خانم­های خانه­ دار.',
                '* حضور کلیه مسافرین جهت انگشت نگاری در سفارت الزامی می­باشد.',
                '* مدارک تا زمان بازگشت مسافر از سفر، نزد آژانس باقی می­ماند.',
                '* چک رمزدار یا ضمانت­نامه بانکی حداقل به مبلغ 500،000،000 ریال در وجه آژانس محل ثبت نام جهت ضمانت حسن اجرای تعهدات که پس از بررسی مدارک در صورت نیاز به ضمانت ­های بیشتر متعاقبا­ً اعلام می­گردد. ',
                '* کلیه مدارک نیاز به 2 سری کپی در برگه A4 دارند.',
            ],
            file: ''
        }
    ]
    categories: any[] = [
        {
            id: '1',
            text: 'توریستی'
        },
        {
            id: '2',
            text: 'نمایشگاهی'
        }
    ]
    runningTours: string[] = ['1']
    tours: Tour[] =
        [
            {
                id: '1',
                img: '/assets/images/tours/1.jpg',
                destinationCountries: ['ایتالیا', 'اسپانیا'],
                destinationCities: [
                    {
                        nights: 3,
                        city: 'میلان'
                    },
                    {
                        nights: 2,
                        city: 'ونیز'
                    }
                ],
                code: 'kz426',
                date: {
                    startMiladi: '',
                    startShamsi: '3 فروردین',
                    endMiladi: '',
                    endShamsi: '7 فروردین'
                },
                vehicle: '',
                gallery: ['/assets/images/tours/1.jpg'],
                days: 5,
                category: '1',
                services: [
                    'راهنماي تور فارسي زبان',
                    'یمه مسافرتی',
                    'گشت و بازدید از اماکن دیدنی',
                    'خدمات اخذ ویزا ',
                    'بلیط پرواز رفت و برگشت',
                    'هتل چهار ستاره با صبحانه'
                ],
                adult: {
                    euro: 1542,
                    tooman: 3950000
                },
                child4To12: {
                    euro: 1542,
                    tooman: 3450000
                },
                child2To4: {
                    euro: 1542,
                    tooman: 3450000
                },
                child0To2: {
                    euro: 1542,
                    tooman: 2500000
                },
                plans: [
                    {
                        title: 'روز اول',
                        subTitle: 'مادرید',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                    {
                        title: 'روز دوم',
                        subTitle: 'زوبیخ',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                ],
                comments: [
                    {
                        owner: 'زمانی',
                        img: '',
                        date: '1397/08/10',
                        rate: 4,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: ``,
                        likes: 0,
                        dislikes: 0,
                    },
                    {
                        owner: 'علیرضا',
                        img: '',
                        date: '1396/12/15',
                        rate: 2,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: `جناب آقای علیرضا
                         با تشکر از شما بابت ابراز لطفتان به مجموعه کاریز، خرسندیم که سفری بدون دغدغه را تجربه کرده‌اید. به
                         امید دیدار.`,
                        likes: 0,
                        dislikes: 0,
                    }
                ],
                class: 'Royal Class',
                hotelRate: 5,
                noruzi: true,
                running: true,
                description: 'سفر با ورود به شهر زوریخ آغاز می‌شود. در این شهر رویایی لذت دیدار از خیابان بانهوف و کلیسای گروس‌مونستر را از دست ندهید، پس از زوریخ راهی اسپانیا و شهر بارسلون خواهید شد. در این شهر حیرت‌انگیز فرصت داریم تا از شاهکارهای گائودی مانند کلیسای ساگرادا فامیلیا، کازا میلا، کازا باتیو و ... دیدن کنیم. مطمئناً فرصت قدم زدن در خیابان رامبلا و خوردن یک عصرانه‌ی دلچسب، خاطرات سفرمان را ماندگار‌تر می‌کند.'
            },
            {
                id: '2',
                img: '/assets/images/tours/2.jpg',
                destinationCountries: ['ایتالیا', 'اسپانیا'],
                destinationCities: [
                    {
                        nights: 3,
                        city: 'میلان'
                    },
                    {
                        nights: 2,
                        city: 'ونیز'
                    }
                ],
                code: 'kz426',
                date: {
                    startMiladi: '',
                    startShamsi: '3 فروردین',
                    endMiladi: '',
                    endShamsi: '7 فروردین'
                },
                vehicle: '',
                gallery: ['/assets/images/tours/2.jpg'],
                days: 5,
                category: '1',
                services: [
                    'راهنماي تور فارسي زبان',
                    'یمه مسافرتی',
                    'گشت و بازدید از اماکن دیدنی',
                    'خدمات اخذ ویزا ',
                    'بلیط پرواز رفت و برگشت',
                    'هتل چهار ستاره با صبحانه'
                ],
                adult: {
                    euro: 1542,
                    tooman: 3950000
                },
                child4To12: {
                    euro: 1542,
                    tooman: 3450000
                },
                child2To4: {
                    euro: 1542,
                    tooman: 3450000
                },
                child0To2: {
                    euro: 1542,
                    tooman: 2500000
                },
                plans: [
                    {
                        title: 'روز اول',
                        subTitle: 'مادرید',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                    {
                        title: 'روز دوم',
                        subTitle: 'زوبیخ',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                ],
                comments: [
                    {
                        owner: 'زمانی',
                        img: '',
                        date: '1397/08/10',
                        rate: 4,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: ``,
                        likes: 0,
                        dislikes: 0,
                    },
                    {
                        owner: 'علیرضا',
                        img: '',
                        date: '1396/12/15',
                        rate: 2,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: `جناب آقای علیرضا
                         با تشکر از شما بابت ابراز لطفتان به مجموعه کاریز، خرسندیم که سفری بدون دغدغه را تجربه کرده‌اید. به
                         امید دیدار.`,
                        likes: 0,
                        dislikes: 0,
                    }
                ],
                class: 'Royal Class',
                hotelRate: 5,
                noruzi: true,
                running: true,
                description: 'سفر با ورود به شهر زوریخ آغاز می‌شود. در این شهر رویایی لذت دیدار از خیابان بانهوف و کلیسای گروس‌مونستر را از دست ندهید، پس از زوریخ راهی اسپانیا و شهر بارسلون خواهید شد. در این شهر حیرت‌انگیز فرصت داریم تا از شاهکارهای گائودی مانند کلیسای ساگرادا فامیلیا، کازا میلا، کازا باتیو و ... دیدن کنیم. مطمئناً فرصت قدم زدن در خیابان رامبلا و خوردن یک عصرانه‌ی دلچسب، خاطرات سفرمان را ماندگار‌تر می‌کند.'
            },
            {
                id: '3',
                img: '/assets/images/tours/3.jpg',
                destinationCountries: ['ایتالیا', 'اسپانیا'],
                destinationCities: [
                    {
                        nights: 3,
                        city: 'میلان'
                    },
                    {
                        nights: 2,
                        city: 'ونیز'
                    }
                ],
                code: 'kz426',
                date: {
                    startMiladi: '',
                    startShamsi: '3 فروردین',
                    endMiladi: '',
                    endShamsi: '7 فروردین'
                },
                vehicle: '',
                gallery: ['/assets/images/tours/3.jpg'],
                days: 5,
                category: '1',
                services: [
                    'راهنماي تور فارسي زبان',
                    'یمه مسافرتی',
                    'گشت و بازدید از اماکن دیدنی',
                    'خدمات اخذ ویزا ',
                    'بلیط پرواز رفت و برگشت',
                    'هتل چهار ستاره با صبحانه'
                ],
                adult: {
                    euro: 1542,
                    tooman: 3950000
                },
                child4To12: {
                    euro: 1542,
                    tooman: 3450000
                },
                child2To4: {
                    euro: 1542,
                    tooman: 3450000
                },
                child0To2: {
                    euro: 1542,
                    tooman: 2500000
                },
                plans: [
                    {
                        title: 'روز اول',
                        subTitle: 'مادرید',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                    {
                        title: 'روز دوم',
                        subTitle: 'زوبیخ',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                ],
                comments: [
                    {
                        owner: 'زمانی',
                        img: '',
                        date: '1397/08/10',
                        rate: 4,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: ``,
                        likes: 0,
                        dislikes: 0,
                    },
                    {
                        owner: 'علیرضا',
                        img: '',
                        date: '1396/12/15',
                        rate: 2,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: `جناب آقای علیرضا
                         با تشکر از شما بابت ابراز لطفتان به مجموعه کاریز، خرسندیم که سفری بدون دغدغه را تجربه کرده‌اید. به
                         امید دیدار.`,
                        likes: 0,
                        dislikes: 0,
                    }
                ],
                class: 'Cost Class',
                hotelRate: 5,
                noruzi: true,
                running: true,
                description: 'سفر با ورود به شهر زوریخ آغاز می‌شود. در این شهر رویایی لذت دیدار از خیابان بانهوف و کلیسای گروس‌مونستر را از دست ندهید، پس از زوریخ راهی اسپانیا و شهر بارسلون خواهید شد. در این شهر حیرت‌انگیز فرصت داریم تا از شاهکارهای گائودی مانند کلیسای ساگرادا فامیلیا، کازا میلا، کازا باتیو و ... دیدن کنیم. مطمئناً فرصت قدم زدن در خیابان رامبلا و خوردن یک عصرانه‌ی دلچسب، خاطرات سفرمان را ماندگار‌تر می‌کند.'
            },
            {
                id: '4',
                img: '/assets/images/tours/4.jpg',
                destinationCountries: ['ایتالیا', 'اسپانیا'],
                destinationCities: [
                    {
                        nights: 3,
                        city: 'میلان'
                    },
                    {
                        nights: 2,
                        city: 'ونیز'
                    }
                ],
                code: 'kz426',
                date: {
                    startMiladi: '',
                    startShamsi: '3 فروردین',
                    endMiladi: '',
                    endShamsi: '7 فروردین'
                },
                vehicle: '',
                gallery: ['/assets/images/tours/4.jpg'],
                days: 5,
                category: '1',
                services: [
                    'راهنماي تور فارسي زبان',
                    'یمه مسافرتی',
                    'گشت و بازدید از اماکن دیدنی',
                    'خدمات اخذ ویزا ',
                    'بلیط پرواز رفت و برگشت',
                    'هتل چهار ستاره با صبحانه'
                ],
                adult: {
                    euro: 1542,
                    tooman: 3950000
                },
                child4To12: {
                    euro: 1542,
                    tooman: 3450000
                },
                child2To4: {
                    euro: 1542,
                    tooman: 3450000
                },
                child0To2: {
                    euro: 1542,
                    tooman: 2500000
                },
                plans: [
                    {
                        title: 'روز اول',
                        subTitle: 'مادرید',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                    {
                        title: 'روز دوم',
                        subTitle: 'زوبیخ',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                ],
                comments: [
                    {
                        owner: 'زمانی',
                        img: '',
                        date: '1397/08/10',
                        rate: 4,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: ``,
                        likes: 0,
                        dislikes: 0,
                    },
                    {
                        owner: 'علیرضا',
                        img: '',
                        date: '1396/12/15',
                        rate: 2,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: `جناب آقای علیرضا
                         با تشکر از شما بابت ابراز لطفتان به مجموعه کاریز، خرسندیم که سفری بدون دغدغه را تجربه کرده‌اید. به
                         امید دیدار.`,
                        likes: 0,
                        dislikes: 0,
                    }
                ],
                class: 'First Class',
                hotelRate: 5,
                noruzi: true,
                running: true,
                description: 'سفر با ورود به شهر زوریخ آغاز می‌شود. در این شهر رویایی لذت دیدار از خیابان بانهوف و کلیسای گروس‌مونستر را از دست ندهید، پس از زوریخ راهی اسپانیا و شهر بارسلون خواهید شد. در این شهر حیرت‌انگیز فرصت داریم تا از شاهکارهای گائودی مانند کلیسای ساگرادا فامیلیا، کازا میلا، کازا باتیو و ... دیدن کنیم. مطمئناً فرصت قدم زدن در خیابان رامبلا و خوردن یک عصرانه‌ی دلچسب، خاطرات سفرمان را ماندگار‌تر می‌کند.'
            },
            {
                id: '5',
                img: '/assets/images/tours/5.jpg',
                destinationCountries: ['ایتالیا', 'اسپانیا'],
                destinationCities: [
                    {
                        nights: 3,
                        city: 'میلان'
                    },
                    {
                        nights: 2,
                        city: 'ونیز'
                    }
                ],
                code: 'kz426',
                date: {
                    startMiladi: '',
                    startShamsi: '3 فروردین',
                    endMiladi: '',
                    endShamsi: '7 فروردین'
                },
                vehicle: '',
                gallery: ['/assets/images/tours/5.jpg'],
                days: 5,
                category: '1',
                services: [
                    'راهنماي تور فارسي زبان',
                    'یمه مسافرتی',
                    'گشت و بازدید از اماکن دیدنی',
                    'خدمات اخذ ویزا ',
                    'بلیط پرواز رفت و برگشت',
                    'هتل چهار ستاره با صبحانه'
                ],
                adult: {
                    euro: 1542,
                    tooman: 3950000
                },
                child4To12: {
                    euro: 1542,
                    tooman: 3450000
                },
                child2To4: {
                    euro: 1542,
                    tooman: 3450000
                },
                child0To2: {
                    euro: 1542,
                    tooman: 2500000
                },
                plans: [
                    {
                        title: 'روز اول',
                        subTitle: 'مادرید',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                    {
                        title: 'روز دوم',
                        subTitle: 'زوبیخ',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                ],
                comments: [
                    {
                        owner: 'زمانی',
                        img: '',
                        date: '1397/08/10',
                        rate: 4,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: ``,
                        likes: 0,
                        dislikes: 0,
                    },
                    {
                        owner: 'علیرضا',
                        img: '',
                        date: '1396/12/15',
                        rate: 2,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: `جناب آقای علیرضا
                         با تشکر از شما بابت ابراز لطفتان به مجموعه کاریز، خرسندیم که سفری بدون دغدغه را تجربه کرده‌اید. به
                         امید دیدار.`,
                        likes: 0,
                        dislikes: 0,
                    }
                ],
                class: 'Royal Class',
                hotelRate: 5,
                noruzi: true,
                running: true,
                description: 'سفر با ورود به شهر زوریخ آغاز می‌شود. در این شهر رویایی لذت دیدار از خیابان بانهوف و کلیسای گروس‌مونستر را از دست ندهید، پس از زوریخ راهی اسپانیا و شهر بارسلون خواهید شد. در این شهر حیرت‌انگیز فرصت داریم تا از شاهکارهای گائودی مانند کلیسای ساگرادا فامیلیا، کازا میلا، کازا باتیو و ... دیدن کنیم. مطمئناً فرصت قدم زدن در خیابان رامبلا و خوردن یک عصرانه‌ی دلچسب، خاطرات سفرمان را ماندگار‌تر می‌کند.'
            },
            {
                id: '6',
                img: '/assets/images/tours/6.jpg',
                destinationCountries: ['ایتالیا', 'اسپانیا'],
                destinationCities: [
                    {
                        nights: 3,
                        city: 'میلان'
                    },
                    {
                        nights: 2,
                        city: 'ونیز'
                    }
                ],
                code: 'kz426',
                date: {
                    startMiladi: '',
                    startShamsi: '3 فروردین',
                    endMiladi: '',
                    endShamsi: '7 فروردین'
                },
                vehicle: '',
                gallery: ['/assets/images/tours/6.jpg'],
                days: 5,
                category: '1',
                services: [
                    'راهنماي تور فارسي زبان',
                    'یمه مسافرتی',
                    'گشت و بازدید از اماکن دیدنی',
                    'خدمات اخذ ویزا ',
                    'بلیط پرواز رفت و برگشت',
                    'هتل چهار ستاره با صبحانه'
                ],
                adult: {
                    euro: 1542,
                    tooman: 3950000
                },
                child4To12: {
                    euro: 1542,
                    tooman: 3450000
                },
                child2To4: {
                    euro: 1542,
                    tooman: 3450000
                },
                child0To2: {
                    euro: 1542,
                    tooman: 2500000
                },
                plans: [
                    {
                        title: 'روز اول',
                        subTitle: 'مادرید',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                    {
                        title: 'روز دوم',
                        subTitle: 'زوبیخ',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                ],
                comments: [
                    {
                        owner: 'زمانی',
                        img: '',
                        date: '1397/08/10',
                        rate: 4,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: ``,
                        likes: 0,
                        dislikes: 0,
                    },
                    {
                        owner: 'علیرضا',
                        img: '',
                        date: '1396/12/15',
                        rate: 2,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: `جناب آقای علیرضا
                         با تشکر از شما بابت ابراز لطفتان به مجموعه کاریز، خرسندیم که سفری بدون دغدغه را تجربه کرده‌اید. به
                         امید دیدار.`,
                        likes: 0,
                        dislikes: 0,
                    }
                ],
                class: 'Royal Class',
                hotelRate: 5,
                noruzi: true,
                running: true,
                description: 'سفر با ورود به شهر زوریخ آغاز می‌شود. در این شهر رویایی لذت دیدار از خیابان بانهوف و کلیسای گروس‌مونستر را از دست ندهید، پس از زوریخ راهی اسپانیا و شهر بارسلون خواهید شد. در این شهر حیرت‌انگیز فرصت داریم تا از شاهکارهای گائودی مانند کلیسای ساگرادا فامیلیا، کازا میلا، کازا باتیو و ... دیدن کنیم. مطمئناً فرصت قدم زدن در خیابان رامبلا و خوردن یک عصرانه‌ی دلچسب، خاطرات سفرمان را ماندگار‌تر می‌کند.'
            },
            {
                id: '7',
                img: '/assets/images/tours/7.jpg',
                destinationCountries: ['ایتالیا', 'اسپانیا'],
                destinationCities: [
                    {
                        nights: 3,
                        city: 'میلان'
                    },
                    {
                        nights: 2,
                        city: 'ونیز'
                    }
                ],
                code: 'kz426',
                date: {
                    startMiladi: '',
                    startShamsi: '3 فروردین',
                    endMiladi: '',
                    endShamsi: '7 فروردین'
                },
                vehicle: '',
                gallery: ['/assets/images/tours/7.jpg'],
                days: 5,
                category: '1',
                services: [
                    'راهنماي تور فارسي زبان',
                    'یمه مسافرتی',
                    'گشت و بازدید از اماکن دیدنی',
                    'خدمات اخذ ویزا ',
                    'بلیط پرواز رفت و برگشت',
                    'هتل چهار ستاره با صبحانه'
                ],
                adult: {
                    euro: 1542,
                    tooman: 3950000
                },
                child4To12: {
                    euro: 1542,
                    tooman: 3450000
                },
                child2To4: {
                    euro: 1542,
                    tooman: 3450000
                },
                child0To2: {
                    euro: 1542,
                    tooman: 2500000
                },
                plans: [
                    {
                        title: 'روز اول',
                        subTitle: 'مادرید',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                    {
                        title: 'روز دوم',
                        subTitle: 'زوبیخ',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                ],
                comments: [
                    {
                        owner: 'زمانی',
                        img: '',
                        date: '1397/08/10',
                        rate: 4,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: ``,
                        likes: 0,
                        dislikes: 0,
                    },
                    {
                        owner: 'علیرضا',
                        img: '',
                        date: '1396/12/15',
                        rate: 2,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: `جناب آقای علیرضا
                         با تشکر از شما بابت ابراز لطفتان به مجموعه کاریز، خرسندیم که سفری بدون دغدغه را تجربه کرده‌اید. به
                         امید دیدار.`,
                        likes: 0,
                        dislikes: 0,
                    }
                ],
                class: 'Royal Class',
                hotelRate: 5,
                noruzi: true,
                running: true,
                description: 'سفر با ورود به شهر زوریخ آغاز می‌شود. در این شهر رویایی لذت دیدار از خیابان بانهوف و کلیسای گروس‌مونستر را از دست ندهید، پس از زوریخ راهی اسپانیا و شهر بارسلون خواهید شد. در این شهر حیرت‌انگیز فرصت داریم تا از شاهکارهای گائودی مانند کلیسای ساگرادا فامیلیا، کازا میلا، کازا باتیو و ... دیدن کنیم. مطمئناً فرصت قدم زدن در خیابان رامبلا و خوردن یک عصرانه‌ی دلچسب، خاطرات سفرمان را ماندگار‌تر می‌کند.'
            },
            {
                id: '8',
                img: '/assets/images/tours/8.jpg',
                destinationCountries: ['ایتالیا', 'اسپانیا'],
                destinationCities: [
                    {
                        nights: 3,
                        city: 'میلان'
                    },
                    {
                        nights: 2,
                        city: 'ونیز'
                    }
                ],
                code: 'kz426',
                date: {
                    startMiladi: '',
                    startShamsi: '3 فروردین',
                    endMiladi: '',
                    endShamsi: '7 فروردین'
                },
                vehicle: '',
                gallery: ['/assets/images/tours/8.jpg'],
                days: 5,
                category: '1',
                services: [
                    'راهنماي تور فارسي زبان',
                    'یمه مسافرتی',
                    'گشت و بازدید از اماکن دیدنی',
                    'خدمات اخذ ویزا ',
                    'بلیط پرواز رفت و برگشت',
                    'هتل چهار ستاره با صبحانه'
                ],
                adult: {
                    euro: 1542,
                    tooman: 3950000
                },
                child4To12: {
                    euro: 1542,
                    tooman: 3450000
                },
                child2To4: {
                    euro: 1542,
                    tooman: 3450000
                },
                child0To2: {
                    euro: 1542,
                    tooman: 2500000
                },
                plans: [
                    {
                        title: 'روز اول',
                        subTitle: 'مادرید',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                    {
                        title: 'روز دوم',
                        subTitle: 'زوبیخ',
                        description: 'سفر ما از فرودگاه امام خمینی آغاز می شود. پس از گردهم آمدن کلیه همسفران و بازنگری مدارک، جهت انجام امور پرواز (دریافت کارت پرواز و تحویل بار) به سمت سالن ترانزیت حرکت می‌کنیم. تهران را به سمت مادرید ترک می‌کنیم. '
                    },
                ],
                comments: [
                    {
                        owner: 'زمانی',
                        img: '',
                        date: '1397/08/10',
                        rate: 4,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: ``,
                        likes: 0,
                        dislikes: 0,
                    },
                    {
                        owner: 'علیرضا',
                        img: '',
                        date: '1396/12/15',
                        rate: 2,
                        text: `کلا از شروع مقدمات مسافرت کلیه کارها ار قبیل ویزا و توجیه تا پرواز بخوبی انجام شد در مدت مسافرت و
                         دیدار از شهرهای مختلف اسپانیا هم با وجود راهنمای آگاه و دلسوز و خوش اخلاق بسیار عالی بود و هیچگونه
                         اشکالی پیش نیامد مخصوصا همه نقاط دیدنی از قبل برنامه ریزی شده بود با تشکر از مدیریت کاریز`,
                        replayText: `جناب آقای علیرضا
                         با تشکر از شما بابت ابراز لطفتان به مجموعه کاریز، خرسندیم که سفری بدون دغدغه را تجربه کرده‌اید. به
                         امید دیدار.`,
                        likes: 0,
                        dislikes: 0,
                    }
                ],
                class: 'Royal Class',
                hotelRate: 5,
                noruzi: true,
                running: true,
                description: 'سفر با ورود به شهر زوریخ آغاز می‌شود. در این شهر رویایی لذت دیدار از خیابان بانهوف و کلیسای گروس‌مونستر را از دست ندهید، پس از زوریخ راهی اسپانیا و شهر بارسلون خواهید شد. در این شهر حیرت‌انگیز فرصت داریم تا از شاهکارهای گائودی مانند کلیسای ساگرادا فامیلیا، کازا میلا، کازا باتیو و ... دیدن کنیم. مطمئناً فرصت قدم زدن در خیابان رامبلا و خوردن یک عصرانه‌ی دلچسب، خاطرات سفرمان را ماندگار‌تر می‌کند.'
            },
        ]
    topSales: string[] = ['1', '2', '3', '4', '5', '6', '7', '8'];

    getTours(): Tour[] {
        return this.tours;
    }

    getCountry(country) {
        for (const c of this.countries)
            if (c.country == country)
                return c
    }

    getTour(id: string): Tour {
        return this.tours.find(t => t.id == id);
    }

    getCategory(id: string): string {
        let category = this.categories.find(c => c.id == id);
        return category.text;
    }

    getNoruzTours(): Tour[] {
        const noruzTours: Tour[] = [];
        for (const tour of this.tours) {
            if (tour.noruzi)
                noruzTours.push(tour)
        }
        return noruzTours;
    }
    getTourClasses(): string[] {
        return this.tourClasses
    }
}