import { Injectable } from '@angular/core';

import { Post, Country } from './model/post';


@Injectable()
export class PostService {

  constructor() { }
  months = ['فروردین', 'اردیبهشت', 'خرداد', 'تیر', 'مرداد', 'شهریور', 'مهر', 'آبان', 'آذر', 'دی', 'بهمن', 'اسفند'];

  posts: Post[] =
    [
      {
        id: '1',
        title: 'جاذبه های گردشگری هانوی، پایتخت کشور ویتنام',
        date: '1397-09-26',
        country: '1',
        image: 'https://colorlib.com/preview/theme/travello/images/news_2.jpg',
        summary: 'شهر هانوی (Hanoi)، پایتخت کشور ویتنام است و بیش از هزاران سال قدمت دارد. هانوی، مهم‌ترین مرکز سیاسی این کشور به حساب می‌آید و جاذبه‌های گردشگری متنوعی را در برمی‌گیرد که فرهنگ مردم ویتنام و تاریخچه‌ی طولانی آن را از دوران تأسیس تا آزادی‌اش از استعمار کشور فرانسه و آمریکا به نمایش می‌گذارد. اگر به زودی قصد سفر به این کشور را دارید، بازدید از مکان‌های دیدنی زیر را از دست ندهید.',
        description: 'دریاچه‌ی هوان کیِم (Hoan Kiem Lake) به معنی «شمشیر بازگردانده شده»، همان محلی به‌شمار می‌رود که افسانه‌ی معروف ویتنامی اتفاق افتاده است. طبق این داستان، یکی از امپراطوران ویتنام شمشیری را از لاک‌پشت افسانه‌ای دریاچه‌ی هوان کیِم دریافت می‌کند و به کمک آن، مهاجمان چینی را از خاک ویتنام بیرون می‌راند. دریاچه‌ی هوان کیِم، فاصله‌ی چندانی تا محله‌ی قدیمی شهر هانوی ندارد و امروزه ، مرکز پرطرفداری برای گشت‌وگذار و گردهم آمدن مردم به حساب می‌آید و بیشتر زوج‌ها هم این دریاچه را برای گرفتن عکس‌های عروسی‌شان انتخاب می‌کنند. همچنین اگر هنگام صبح به این دریاچه بروید احتمالاً ورزشکاران بسیاری را در حال انجام تمرین‌های صبحگاهی‌شان خواهید دید. پل چوبی و قرمز رنگ زیبای این دریاچه، شما را به معبد کوه جِید (Temple of the Jade Mountain) می‌رساند که بعضی از مردم هنوز هم مراسم مذهبی خود را در این مکان انجام می‌دهند.',
      },
      {
        id: '2',
        title: 'مانه، نقاشی که تا آخر عمر تحقیر شد',
        date: '1397-01-09',
        country: '3',
        image: 'https://cdn01.eavar.com/2019/1/0cc05d9f-bdcb-4e1a-bc37-7ed30565ec2b-360x330.jpg',
        summary: 'ادوارد مانه به عنوان یکی از بحث‌ برانگیزترین هنرمندان زمان خود شهرت داشت و از نگاه منتقدان خود فراتر رفت تا استعداد خود را به اثبات برساند. او با نقاشی‌های بی‌شماری که هنرمندان جوان آن دوران را الهام می‌بخشید، نشان داد که چطور نوآوری اغلب در جامعه با روی باز پذیرفته نمی‌شود، اما دروازه‌ای به سوی آینده است. در این مقاله به مانه خواهیم پرداخت که علی‌رغم تمام انتقادها به موفقیت قابل توجهی دست یافت.',
        description: 'ادوارد مانه در ۲۳ ژانویه سال ۱۸۳۲ در پاریسِ پر جنب و جوش چشم به جهان گشود و خانواده‌ای مشهور و موفق داشت. مادر و پدر او در شهر شناخته شده بودند. پدرش یک قاضی به‌نام و مادرش از تبار سلطنتی بود. در همان اوایل زندگی، مانه فهمید که به هنر علاقه ویژه‌ای دارد و در این زمینه از عموی خود نیز حمایت قابل توجهی گرفت. او به همراه عمویش به بازدید از موزه لوور رفت و در همان‌جا بود که با الهامات جدیدش به توسعه مهارت‌های هنری‌اش پرداخت. مانه در سال ۱۸۴۵، تصمیم به نام‌نویسی در یک دوره طراحی گرفت. در همان زمان بود که با «آنتونن پروست» آشنا شد که بعدها در زمره‌ی بهترین دوستانش قرار گرفت.',
      },
      {
        id: '3',
        title: 'گشت و گذار در محله چینی ها در کوبه، نانکینماچی',
        date: '1397-03-15',
        country: '1',
        image: 'https://cdn01.eavar.com/2019/1/86a42455-af66-4b51-8618-2eb50ecce58d.jpg',
        summary: 'محله‌ی چینی‌ها در خیلی از شهرهای دنیا وجود دارند و به مقاصد گردشگری محبوبی تبدیل شده‌اند. محله‌ی چینی‌ها در کوبه که به نام نانکینماچی شناخته می‌شود از جمله محله‌های خاص و زیبای این شهر است.',
        description: 'شهر «کوبه» در ژاپن اتمسفر خاص و جالبی دارد. میراث این شهر قدیمی و زیبایی‌های طبیعی‌اش، آن‌را به یکی از جاذبه‌های گردشگری ژاپن تبدیل کرده است. در کشور ژاپن، محله‌ی چینی‌ها در شهرهای مختلفی ازجمله توکیو و کوبه وجود دارد. اگرچه این محله‌ها در شهرهای اصلی ژاپن در حال گسترش است، اما محله‌ی چینی‌ها در کوبه، حس خاصی به این شهر می‌بخشد. محله‌ی چینی‌ها یا نانکینماچی یکی دیگر از جاذبه‌های کوبه است که در این مطلب بیشتر درباره‌ی آن خواهید خواند.',
      },
      {
        id: '4',
        title: 'برج توکیو اسکای، بلندترین برج ژاپن',
        date: '1397-06-18',
        country: '25',
        image: 'https://cdn01.eavar.com/2017/5/153b8d7e-3301-437d-a8b9-9484654be1e3.jpg',
        summary: 'تراس «تِمبو» (Tembo) یا همان تراس پایینی، با ارتفاع ۳۵۰ متر از سه طبقه با نمایی ۳۶۰ درجه تشکیل شده است. طبقه سوم پنجره‌هایی بلند و بزرگ دارد که بهترین مناظر تمام نمای شهر را می‌توانید از آن‌ها تماشا کنید.',
        description: 'تراس «تِمبو» (Tembo) یا همان تراس پایینی، با ارتفاع ۳۵۰ متر از سه طبقه با نمایی ۳۶۰ درجه تشکیل شده است. طبقه سوم پنجره‌هایی بلند و بزرگ دارد که بهترین مناظر تمام نمای شهر را می‌توانید از آن‌ها تماشا کنید. در طبقه میانی یک سوغاتی فروشی، رستوران «موساشی اسکای» (Musashi Sky) با غذاهای فرانسوی-ژاپنی قرار دارند و در طبقه زیرین نیز یک کافه و پنل‌هایی شیشه‌ای روی زمین برای تماشای پایین برج دیده می‌شوند. یک آسانسور، تراس تمبو را به گالری تمبو وصل می‌کند. گالری تمبو از یک رمپ مارپیچ تشکیل شده که دور برج پیچیده و بالا می‌رود. شیوه ساخت آن از استیل و شیشه به گونه‌ای است که بازدیدکنندگان می‌توانند به پایین نگاه کرده و از ارتفاع برج و مناظر منطقه «کانتو» در دور دست لذت ببرند.',
      },
    ];
  gharre: string[] = ['اروپا', 'آسیا', 'آفریقا', 'آمریکا', 'استرالیا'];
  countries: Country[] = [
    {
      id: '0',
      name: 'فرانسه',
      gharre: 'اروپا',
    },
    {
      id: '1',
      name: 'انگلیس',
      gharre: 'اروپا',
    },
    {
      id: '2',
      name: 'یونان',
      gharre: 'اروپا',
    },
    {
      id: '3',
      name: 'اسپانیا',
      gharre: 'اروپا',
    },
    {
      id: '4',
      name: 'سوئیس',
      gharre: 'اروپا',
    },
    {
      id: '5',
      name: 'هلند',
      gharre: 'اروپا',
    },
    {
      id: '6',
      name: 'ایتالیا',
      gharre: 'اروپا',
    },
    {
      id: '7',
      name: 'اتریش',
      gharre: 'اروپا',
    },
    {
      id: '8',
      name: 'آلمان',
      gharre: 'اروپا',
    },
    {
      id: '9',
      name: 'ترکیه',
      gharre: 'اروپا',
    },
    {
      id: '10',
      name: 'سوئد',
      gharre: 'اروپا',
    },
    {
      id: '11',
      name: 'نروژ',
      gharre: 'اروپا',
    },
    {
      id: '12',
      name: 'مجارستان',
      gharre: 'اروپا',
    },
    {
      id: '13',
      name: 'کرواسی',
      gharre: 'اروپا',
    },
    {
      id: '14',
      name: 'دانمارک',
      gharre: 'اروپا',
    },
    {
      id: '15',
      name: 'صربستان',
      gharre: 'اروپا',
    },
    {
      id: '16',
      name: 'فنلاند',
      gharre: 'اروپا',
    },
    {
      id: '17',
      name: 'پرتغال',
      gharre: 'اروپا',
    },
    {
      id: '18',
      name: 'جمهوری چک',
      gharre: 'اروپا',
    },
    {
      id: '19',
      name: 'روسیه',
      gharre: 'اروپا',
    },
    {
      id: '20',
      name: 'بلژیک',
      gharre: 'اروپا',
    },
    {
      id: '21',
      name: 'سنگاپور',
      gharre: 'آسیا',
    },
    {
      id: '22',
      name: 'مالزی',
      gharre: 'آسیا',
    },
    {
      id: '23',
      name: 'نپال',
      gharre: 'آسیا',
    },
    {
      id: '24',
      name: 'هند',
      gharre: 'آسیا',
    },
    {
      id: '25',
      name: 'ژاپن',
      gharre: 'آسیا',
    },
    {
      id: '26',
      name: 'کره جنوبی',
      gharre: 'آسیا',
    },
    {
      id: '27',
      name: 'عمان',
      gharre: 'آسیا',
    },
    {
      id: '28',
      name: 'تایلند',
      gharre: 'آسیا',
    },
    {
      id: '29',
      name: 'چین',
      gharre: 'آسیا',
    },
    {
      id: '30',
      name: 'تانزانیا',
      gharre: 'آفریقا',
    },
    {
      id: '31',
      name: 'سیشل',
      gharre: 'آفریقا',
    },
    {
      id: '32',
      name: 'مراکش',
      gharre: 'آفریقا',
    },
    {
      id: '33',
      name: 'آفریقای جنوبی',
      gharre: 'آفریقا',
    },
    {
      id: '34',
      name: 'کوبا',
      gharre: 'آمریکا',
    },
    {
      id: '35',
      name: 'مکزیک',
      gharre: 'آمریکا',
    },
    {
      id: '36',
      name: 'آرژانتین',
      gharre: 'آمریکا',
    },
    {
      id: '37',
      name: 'برزیل',
      gharre: 'آمریکا',
    },
    {
      id: '38',
      name: 'کانادا',
      gharre: 'آمریکا',
    },
    {
      id: '39',
      name: 'استرالیا',
      gharre: 'استرالیا',
    },

  ]
  recentIds: string[] = ['2', '3', '1', '2'];

  getPosts() {
    return this.posts;
  }

  getPost(id) {
    return this.posts.find((post) => post.id == id);
  }

  getRecentPosts() {
    let recentPosts: Post[] = [];
    for (let i = 0; i < this.recentIds.length; i++)
      recentPosts.push(this.getPost(this.recentIds[i]));
    return recentPosts;
  }
  getCountry(id: string) {
    for (const c of this.countries)
      if (c.id == id)
        return c.name
  }

  getMonth(date) {
    let month: string;
    for (let i = date.length; i > 0; i--)
      month = date[date.length - 5] + date[date.length - 4];
    if (month[0] == '0')
      month = month[1];
    return this.months[+month - 1];
  }

  getDay(date) {
    let day: string;
    for (let i = date.length; i > 0; i--)
      day = date[date.length - 2] + date[date.length - 1];
    return day
  }
}
